delete
from calendar;

insert into calendar(date, status, description)
values ('2024-01-01', 'HOLIDAY', 'Новогодние каникулы'),
       ('2024-01-02', 'HOLIDAY', 'Новогодние каникулы'),
       ('2024-01-03', 'HOLIDAY', 'Новогодние каникулы'),
       ('2024-01-04', 'HOLIDAY', 'Новогодние каникулы'),
       ('2024-01-05', 'HOLIDAY', 'Новогодние каникулы'),
       ('2024-01-06', 'HOLIDAY', 'Новогодние каникулы'),
       ('2024-01-07', 'HOLIDAY', 'Новогодние каникулы'),
       ('2024-01-08', 'HOLIDAY', 'Новогодние каникулы');

insert into calendar(date, status)
values ('2024-01-09', 'WORKDAY'),
       ('2024-01-10', 'WORKDAY'),
       ('2024-01-11', 'WORKDAY'),
       ('2024-01-12', 'WORKDAY'),
       ('2024-01-13', 'HOLIDAY'),
       ('2024-01-14', 'HOLIDAY'),
       ('2024-01-15', 'WORKDAY'),
       ('2024-01-16', 'WORKDAY'),
       ('2024-01-17', 'WORKDAY'),
       ('2024-01-18', 'WORKDAY'),
       ('2024-01-19', 'WORKDAY'),
       ('2024-01-20', 'HOLIDAY'),
       ('2024-01-21', 'HOLIDAY'),
       ('2024-01-22', 'WORKDAY'),
       ('2024-01-23', 'WORKDAY'),
       ('2024-01-24', 'WORKDAY'),
       ('2024-01-25', 'WORKDAY'),
       ('2024-01-26', 'WORKDAY'),
       ('2024-01-27', 'HOLIDAY'),
       ('2024-01-28', 'HOLIDAY'),
       ('2024-01-29', 'WORKDAY'),
       ('2024-01-30', 'WORKDAY'),
       ('2024-01-31', 'WORKDAY');